syabyr/micropython/ports/efr32/boards/ikea/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "gecko"
#define MICROPY_HW_MCU_NAME "efr32mg1p"

